{
    "main":[
                {
                  "category":"politics",
          "title":"Trade War Escalates: Now Is the Time to Embrace a Power Struggle with Washington",
        "description":"In the ongoing trade tensions between the United States and the European Union, French leaders are adopting a more assertive tone. France’s Economy Minister Bruno Le Maire called on Europe to defend its interests as forcefully as the U.S. does, criticizing the Inflation Reduction Act (IRA) for drawing investment away from European industries. The IRA, which heavily subsidizes American-made green technologies, is seen in Paris as a strategic threat to Europe’s industrial base. France is advocating for a 'Buy European Act' and urging the European Commission to respond with its own industrial policy. The call reflects a broader push for European strategic autonomy amid global economic rivalry, particularly with the U.S. and China. Despite internal EU divisions, France, led by President Macron, is pushing for a doctrine focused on industrial resilience and economic sovereignty. Critics warn of rising protectionism, but French leaders argue that Europe must stop playing by outdated rules in a world of economic power plays. The message from Paris: cooperation without fairness is no longer enough — and Europe must be ready to push back.",
        "image":"/images/trade-war-france-us-embrace-power-struggle-washington.webp",
        "slug":"trade-war-france-us-embrace-power-struggle-washington",
          "author": "Paul Honda",
          "authorUrl": "/author/phonda",
          "date": "Today",
          "updated": "12:16 a.m.",
          "excerpt": "When Cameron Porter sat patiently on the bench as a freshman on Punahou’s state-championship team of 2023, it was Evan who predicted greatness and goodness for his younger brother."
        }
    ],
    "next":[
          {
              "category":"politics",
    "title": "Drones, Military Aircraft, and Airbus Orders: A Very 'Khaki' Outcome for the 2025 Paris Air Show",
    "author": "Dave Reardon",
    "authorUrl": "/author/dreardon",
    "date": "Today",
    "updated": "12:14 a.m.",
    "excerpt": "The Chace Numata Senior All-Star Classic drew more than 600, including some scouts, to Les Murakami Stadium. The game showcased the talents of nearly 50 standouts from schools statewide.",
    "description":"A Show of Force in the Sky: The 2025 Paris Air Show revealed a clear shift toward military dominance, with dramatic flight displays by Rafale jets, Eurofighters, and advanced drones. Delegations from countries like India and the UAE signed defense agreements, emphasizing growing global investment in air power. Drones stole the spotlight, with UAVs boasting stealth features, AI integration, and longer endurance. Dassault showcased its Neuron drone, while Airbus promoted the Eurodrone, attracting attention from across continents. An analyst noted that drones have gone from accessories to core military assets within a decade. Despite the defense emphasis, Airbus secured over 300 commercial aircraft orders, particularly for the A320neo and A350 models, and reiterated its leadership in sustainable aviation through hydrogen-powered concepts. Airbus's defense products, including the A400M and C295, also gained visibility. U.S. firms like Lockheed Martin and Boeing had strong showings, highlighting NATO priorities such as interoperability and readiness. The show also featured aerospace innovations in cybersecurity and satellite surveillance, blending military and civilian tech. The Paris Air Show has evolved from a commercial event into a defense and tech summit, reflecting today’s turbulent geopolitical climate. While public opinion was mixed, industry leaders hailed the event as a success driven by global demand for security and innovation.",
    "image":"/images/paris-air-show-2025-drones-military.webp",
    "slug":"paris-air-show-2025-drones-military"
  },
  {
      "category":"politics",
    "title":"Why the Sound of Censure Is Echoing Around François Bayrou Once Again",
    "href": "/sports/uh/athletic-director-early-challenges",
    "author": "Stephen Tsai",
    "authorUrl": "/author/stsai",
    "date": "Today",
    "updated": "12:14 a.m.",
    "excerpt": "In a rat-a-tat first week as the University of Hawaii’s athletic director, Matt Elliott met with staff, coaches, athletes and boosters; analyzed reports and data, and acted on day-to-day matters.",
   "description":"The political atmosphere in France has become tense as rumors of a censure motion swirl around François Bayrou, leader of the centrist MoDem party and key ally of President Macron. Though not directly targeted, Bayrou has emerged as a symbolic figure amid concerns over the government's narrow majority and internal dissent. Recent parliamentary votes on immigration, budget, and energy reforms have exposed fractures within Macron's coalition. Bayrou's calls for greater parliamentary respect have fueled speculation of unrest, with opposition leaders hinting at a potential joint motion of censure. While Bayrou denies any intent to break from the government, his comments underscore rising unease. As a veteran figure with a reputation for independence, Bayrou’s stance could influence the fragile balance in the National Assembly. Though the government remains confident, the situation reflects growing vulnerability. The episode highlights both Bayrou’s enduring influence and the precarious unity of Macron’s centrist alliance in 2025.",
    "image":"/images/bayrou-censure-motion-political-tensions-2025.webp",
    "slug":"bayrou-censure-motion-political-tensions-2025"
  
  }

    ],
    "archive":[
  {
    "title": "Television and radio – July 6, 2025",
    "href": "/2025/07/06/sports/tv-radio/television-and-radio-july-6-2025/",
    "image": "https://www.staradvertiser.com/wp-content/uploads/2019/09/TV-and-Radio-promos2-1-1-600x376.jpg",
    "date": "Today",
    "updated": "9:33 p.m."
  },
  {
    "title": "Scoreboard – July 6, 2025",
    "href": "/2025/07/06/sports/scoreboard/scoreboard-july-6-2025/",
    "image": "https://www.staradvertiser.com/wp-content/themes/hsa-redesign/images/thumbnail-default.gif",
    "date": "Today",
    "updated": "8:44 p.m."
},
  {
    "title": "Joey Chestnut wins 17th title, eats 71 hot dogs to reclaim crown",
    "href": "https://www.staradvertiser.com/2025/07/04/sports/sports-breaking/joey-chestnut-wins-17th-title-eats-71-hot-dogs-to-reclaim-crown/",
    "image": "https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_20250704_brk_jch01.jpg",
    "date": "Today",
    "updated": "July 4, 2025",
    "author":" Maiya Keidan / Reuters",
    "excerpt":"Chestnut, 41, of Indiana, ate 71 hot dogs in 10 minutes, landing him the “Mustard Belt” prize for the most dogs consumed"
  },

    {
         
    "title": "Former Hawaii quarterback dealing with serious health issue",
    "href": "https://www.staradvertiser.com/2025/07/04/sports/former-hawaii-quarterback-dealing-with-serious-health-issue/",
    "image": "https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_SPT-SCRIMMAGE-10.jpg",
    "date": "Today",
    "updated": "July 4, 2025",
    "author":" Stephen Tsai",
    "excerpt":"Former University of Hawaii football teammates and coaches are rooting for Brent Rausch’s recovery from an intestinal problem that has caused a nearly 60-pound weight loss."
  
    },
    {
        "title":"Television and radio – July 4, 2025",
        "href":"https://www.staradvertiser.com/2025/07/04/sports/scoreboard-july-4-2025/",
        "image":"https://www.staradvertiser.com/wp-content/themes/hsa-redesign/images/thumbnail-default.gif",
        "date":"July 4, 2025"
        

    }
    ,
    {
        "title":"UH swimmers, divers earn scholar status",
        "href":"https://www.staradvertiser.com/2025/07/04/sports/hawaii-beat/uh-swimmers-divers-earn-scholar-status/",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_10-c5-Erin-McNulty-1.jpg",
        "date":"July 4, 2025",
       
        "author":"Star-Advertiser staff",
        "excerpt":"The Hawaii women’s swimming and diving team was named to the College Swimming and Diving Coaches Association of America Scholar All-America team for the Spring 2025 semester on Thursday"

    }
    ,
    {
        "title":"UH baseball boosts pitching staff with Washington transfer",
        "href":"https://www.staradvertiser.com/2025/07/03/sports/uh-baseball-boosts-pitching-staff-with-washington-transfer/",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_SPT-UH-Baseball-007.jpg",
        "date":"July 3, 2025 ",
        
        "author":"Stephen Tsai",
        "excerpt":"The University of Hawaii baseball team strengthened its pitching staff with the addition of a hard-throwing transfer from the University of Washington."

    }
    ,
    {
        "title":"Television and radio – July 3, 2025",
        "href":"https://www.staradvertiser.com/2025/07/03/sports/television-and-radio-july-3-2025/",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2019/09/TV-and-Radio-promos2-1.jpg",
        "date":"July 3, 2025"

    }
    ,
    {
        "title":"Scoreboard – July 3, 2025",
        "href":"https://www.staradvertiser.com/2025/07/03/sports/scoreboard-july-3-2025/",
        "image":"https://www.staradvertiser.com/wp-content/themes/hsa-redesign/images/thumbnail-default.gif",
        "date":"July 3, 2025"
    }
    ,
    {
        "title":"Kozuma, Ota claim Pro-Pro Championship",
        "href":"https://www.staradvertiser.com/2025/07/02/sports/hawaii-beat/kozuma-ota-claim-pro-pro-championship/",
        "date":"July 2, 2025",
        "author":"Star-Advertiser staff",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_SPT-manoa-cup-13350.jpg"
        

    }
    ,
    {
        "title":"Television and radio – July 2, 2025",
        "href":"https://www.staradvertiser.com/wp-content/uploads/2020/08/TV-and-Radio-promos.jpg",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2020/08/TV-and-Radio-promos.jpg",
        "date":"July 2, 2025"
        

    }
    ,
    {
        "title":"Scoreboard – July 2, 2025",
        "href":"https://www.staradvertiser.com/2025/07/02/sports/scoreboard-july-2-2025/",
        "image":"https://www.staradvertiser.com/wp-content/themes/hsa-redesign/images/thumbnail-default.gif",
        "date":"July 2, 2025"
        

    }
    ,
    {
        "title":"MPI’s Look wins Gatorade award for track",
        "href":"https://www.staradvertiser.com/2025/07/01/sports/hawaii-beat/mpis-look-wins-gatorade-award-for-track/",
        "image":"https://www.staradvertiser.com/wp-content/uploads/2025/07/web1_SPT-PREP-329-copy-v.jpg",
        "date":" July 1, 2025",
        "updated":"",
        "author":"Star-Advertiser staff",
        "excerpt":"Destiny Look of Mid-Pacific was named Gatorade’s Track & Field Player of the Year for Hawaii on Monday. "

    }
    ,
    {
        "title":"Scoreboard – July 1, 2025",
        "href":"https://www.staradvertiser.com/2025/07/01/sports/scoreboard-july-1-2025/",
        "image":"https://www.staradvertiser.com/wp-content/themes/hsa-redesign/images/thumbnail-default.gif",
        "date":"July 1, 2025"
    }
]

}